/* Даны целое число k (1 k 150) и последовательность цифр
101102103...149150, в которой выписаны подряд все трехзначные числа от 101
до 150. 
Определить k-ю цифру, если известно, что:k — одно из чисел 1, 4, 7, ...;*/
#include <iostream>
#include <math.h>
using namespace std;
int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	int k, n;
	cin >> k;
	
	cout << k << "-я цифра равнa 1" << endl;
	
	system("PAUSE");
	return 0;
}